import { useEffect, useRef } from "react"
import "./Contact.css"
import { useLanguage } from "../../context/LanguageContext"
import gsap from "gsap"
import { ScrollTrigger } from "gsap/ScrollTrigger"

gsap.registerPlugin(ScrollTrigger)

const Contact = () => {
  const { t } = useLanguage()
  const contactRef = useRef(null)

  useEffect(() => {
    let ctx = gsap.context(() => {
      gsap.fromTo(".section-title", 
        { y: 30, opacity: 0 },
        {
          scrollTrigger: {
            trigger: ".contact",
            start: "top 80%",
          },
          y: 0,
          opacity: 1,
          duration: 0.6,
          ease: "power2.out"
        }
      );

      gsap.fromTo(".contact-info", 
        { x: -40, opacity: 0 },
        {
          scrollTrigger: {
            trigger: ".contact-container",
            start: "top 80%",
          },
          x: 0,
          opacity: 1,
          duration: 0.6,
          ease: "power2.out"
        }
      );

      gsap.fromTo(".contact-form-container", 
        { x: 40, opacity: 0 },
        {
          scrollTrigger: {
            trigger: ".contact-container",
            start: "top 80%",
          },
          x: 0,
          opacity: 1,
          duration: 0.6,
          ease: "power2.out"
        }
      );
    }, contactRef);

    return () => ctx.revert();
  }, [])

  return (
    <section id="contact" className="contact" ref={contactRef}>
      <div className="container">
        <h2 className="section-title">
          {t('contact.title') || "CONTACT"}
        </h2>

        <div className="contact-container">
          <div className="contact-info retro-container">
            <div className="contact-item">
              <div className="contact-item-icon">📧</div>
              <div className="contact-item-content">
                <h3 className="contact-item-title">{t('contact.email') || "EMAIL"}</h3>
                <p className="contact-item-value">sajitlove@hotmail.com</p>
              </div>
            </div>

            <div className="contact-item">
              <div className="contact-item-icon">📱</div>
              <div className="contact-item-content">
                <h3 className="contact-item-title">{t('contact.phone') || "PHONE"}</h3>
                <p className="contact-item-value">551 725 3335</p>
              </div>
            </div>

            <div className="contact-item">
              <div className="contact-item-icon">🔗</div>
              <div className="contact-item-content">
                <h3 className="contact-item-title">{t('contact.networks') || "NETWORKS"}</h3>
                <div className="contact-social-links">
                  <a href="https://github.com/EseWey21" target="_blank" rel="noopener noreferrer" className="contact-social-link">
                    GitHub
                  </a>
                  <a href="https://linkedin.com/in/sajit-ventura-4197411b7" target="_blank" rel="noopener noreferrer" className="contact-social-link">
                    LinkedIn
                  </a>
                </div>
              </div>
            </div>
          </div>

          <div className="contact-form-container retro-container p-0">
            <div className="ascii-art-container">
              <div className="ascii-art-header">
                <span className="form-title">ASCII_ART.exe</span>
                <div className="form-controls">
                  <span className="form-control">_</span>
                  <span className="form-control">□</span>
                  <span className="form-control">×</span>
                </div>
              </div>
              <div className="ascii-art-content">
                <pre className="ascii-art">
                  {`⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣤⣤⣤⣤⣄⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⡉⠉⠉⠉⠉⠉⠉⠉⠙⠓⠒⠲⠤⢄⣀⡀⠦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢧⠀⠀⠀⠀⠀⠀⠀⠀⡴⠋⠙⢦⡀⠀⠉⠛⠲⢄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣇⠀⠀⠀⠀⠀⠀⡾⠁⢠⠶⣄⠙⣄⠀⠀⠀⠀⠈⠑⠦⣄⠀⢠⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣆⡤⠀⠀⠀⡼⠀⢠⡏⠀⠈⢧⠸⡄⠀⠀⠀⠀⠀⠀⠈⠳⢄⡟⢦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣤⡶⠚⠉⠁⠀⠀⠀⢸⠁⠀⡼⠀⠀⠀⠘⡆⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠳⣄⠙⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢀⣀⣤⣶⡾⠟⠛⠉⠀⠀⠀⠀⠀⠀⠀⢰⡏⠀⠀⡇⠀⣀⡤⠴⠃⠙⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠈⢦⣀⡤⠤⠒⠒⠒⢲⠂⠀⠀⠀⠀⠀⠀⠀⠀⠘⠀
⢀⣀⣠⣴⣶⡿⠿⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⠃⠀⠀⠻⠋⠀⣠⡶⠾⠓⠲⠦⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠖⠉⠀⠀⠀⣀⠴⢲⡾⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠻⣿⣯⡉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⢀⡾⠉⠀⠀⠀⠀⠀⠀⠙⢦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠞⠁⢠⢧⡧⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠻⢿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⣸⠀⠀⠀⠀⠀⢀⡴⢤⠀⠀⠹⡄⠀⠀⡤⠚⠀⠀⠀⠀⠈⢧⣤⣯⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠙⢿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢨⡏⠀⠀⠀⠀⠀⢸⣸⢿⠀⠀⠀⠙⣆⠚⠀⠀⣠⣤⠶⢶⣤⣈⣿⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠙⠻⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⠀⠀⠀⠀⠀⢿⣾⢿⠀⠀⠀⠀⠘⡷⠒⣿⣶⢸⣠⠴⣾⣿⣿⠀⠀⠀⠀⢀⡴⠚⢻⡇⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢳⡀⠀⠀⠀⣸⣇⣸⣤⠤⠴⠶⠖⠓⠶⣿⡼⠊⠁⢀⣼⣿⢹⠀⠀⠀⣰⠏⠀⠀⡞⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣈⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠖⠋⠉⠉⠉⠉⠉⢀⣦⣀⠀⠀⠀⠀⠀⠀⠀⠿⠤⠤⠶⣏⣡⠇⢸⠀⠀⢰⡟⠀⠀⣸⠁⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⠁⠀⠀⠀⠀⠀⠀⠀⠨⠛⠷⣅⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢳⡟⠀⢀⣿⣁⣠⠤⣏⡀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢀⣴⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠉⢣⠭⡀⠀⠀⠀⠉⠙⠒⠒⠒⢒⠀⠀⠀⠀⠀⠀⣸⠁⢀⣿⣏⡁⠀⢀⣀⠙⠲⢤⣀⠀⠀⠀
⠀⠀⠀⠀⢀⣴⣿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢷⠀⠀⠀⠀⠀⠀⢸⠀⠀⠈⠙⠲⠄⠀⠀⠀⠀⠀⡅⠀⠀⠀⠀⣰⡟⠀⣼⠛⠉⢹⠟⠉⠁⠀⠀⣠⠈⠳⣄⠀
⠀⠀⠀⠀⠻⢿⣷⣦⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢧⡀⠀⠀⠀⠀⠘⢤⠀⠀⠀⠀⠀⠀⠀⡀⠎⠀⠀⠀⠀⠀⣰⢟⡴⠚⠁⠀⢠⣿⠀⠀⠀⢠⡞⠁⠀⠀⠈⣧
⠀⠀⠀⠀⠀⠀⠀⠉⠙⠛⠿⠷⣶⣤⣤⣀⣀⠀⠀⠀⠀⠀⠀⠀⠈⠳⣄⡀⠀⠀⠀⠈⠑⠢⠤⠤⠂⠀⠀⠀⠀⠀⠀⢀⣠⡾⠋⡟⠀⠀⣠⢶⠋⢿⣄⡀⢰⠋⠀⠀⢠⡆⢈⡇
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠙⠛⠛⠿⠶⠤⣤⣄⣀⡀⠀⠀⠙⢲⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⠴⠛⠁⠀⣠⣇⠀⠀⠀⠈⡇⠀⠀⠉⠉⠦⠤⢤⠎⢉⡜⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣩⡽⣿⡿⣻⠿⣧⠉⠉⠙⠛⣳⠶⠚⠛⠛⠻⢶⣄⠀⠀⣰⠃⠹⣄⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⢀⣰⠏⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⠴⠚⠉⣤⣞⠗⠉⣰⡿⠁⠀⠀⠀⣸⠃⠀⠀⠀⠀⠀⠀⠹⣿⠏⠹⡆⠀⠈⠓⢦⡀⠀⠀⠀⠀⠀⣀⣴⠟⠁⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣆⠀⣾⡟⠁⠤⣿⣉⣀⡀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠸⡇⠀⠳⠀⠀⠀⠀⠙⠲⠶⢶⣾⠛⠉⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⢀⠀⠀⢀⣤⠈⣧⣿⣂⣀⣈⣛⠷⠎⢻⣀⠀⠀⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡿⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⣠⠶⠟⠟⢀⡞⠁⠀⠀⠀⠀⠀⠀⠀⣸⠋⢳⡀⠈⢧⠀⠀⠀⠀⠀⠀⠀⢰⣏⣧⡀⠀⠀⢀⡴⠒⠛⠋⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢘⠦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⠇⡅⠀⠑⠦⠀⠀⠀⠀⠀⢟⠁⠀⠉⠙⠚⢁⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀`}
                </pre>
              </div>
            </div>
          </div>
        </div>
      </div>
    </section>
  )
}

export default Contact
